schemas/src/main/resources-original/ogc/pubsub/1.0/examples/soap/GetCurrentMessage-request.xml

<?xml version="1.0" encoding="UTF-8"?>
<!--
    The Subscriber or Receiver is checking for messages for its subscription
-->
<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:wsn="http://docs.oasis-open.org/wsn/b-2" xmlns:wsa="http://www.w3.org/2005/08/addressing"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:fes="http://www.opengis.net/fes/2.0"
    xmlns:gml="http://www.opengis.net/gml/3.2"

    xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/
    http://docs.oasis-open.org/wsn/b-2 http://docs.oasis-open.org/wsn/b-2.xsd
    http://www.w3.org/2005/08/addressing http://www.w3.org/2006/03/addressing/ws-addr.xsd
    http://www.opengis.net/fes/2.0 http://schemas.opengis.net/filter/2.0/filterAll.xsd
    http://www.opengis.net/gml/3.2 http://schemas.opengis.net/gml/3.2.1/gml.xsd">

    <s:Header>
        <wsa:Action>http://docs.oasis-open.org/wsn/bw-2/NotificationProducer/GetCurrentMessageRequest</wsa:Action>
    </s:Header>

    <s:Body>

        <wsn:GetCurrentMessage>
            <wsn:Topic Dialect="http://www.opengis.net/pubsub/1.0/subscriptionId">
                http://host.org/pubsub/subscription/aircraftSubscription1
            </wsn:Topic>
        </wsn:GetCurrentMessage>

    </s:Body>
</s:Envelope>
